---
type: SpotLightDistribution
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 5
tags: [revit-api, class]
---

# SpotLightDistribution

`Autodesk.Revit.DB.Lighting.SpotLightDistribution` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpotLightDistribution | — | `` |
| Constructor | SpotLightDistribution | 2013 | `public SpotLightDistribution ()` |
| Property | SpotBeamAngle | 2013 | `public double SpotBeamAngle { get ; set ; }` |
| Property | SpotFieldAngle | 2013 | `public double SpotFieldAngle { get ; set ; }` |
| Property | TiltAngle | 2013 | `public double TiltAngle { get ; set ; }` |